; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 203416 2 3 2 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation4 - direction
	Star6 - direction
	Star5 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(have_image Star7 spectrograph0)
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (turn_to satellite0 star8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
4. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 6
5. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
6. (turn_to satellite1 star8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star8)
   goals met: 0 of 6
7. (turn_to satellite0 phenomenon9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 6
8. (take_image satellite1 star8 instrument2 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 1 of 6
9. (turn_to satellite0 phenomenon12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 6
10. (turn_to satellite1 star7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star7)
   goals met: 1 of 6
11. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 6
12. (take_image satellite1 star7 instrument2 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 2 of 6
13. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 6
14. (turn_to satellite1 phenomenon9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 6
15. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 6
16. (take_image satellite1 phenomenon9 instrument2 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 3 of 6
17. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 6
18. (turn_to satellite1 phenomenon12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 6
19. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 6
20. (take_image satellite1 phenomenon12 instrument2 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 4 of 6
21. (turn_to satellite0 groundstation2 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 6
22. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 6
23. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 6
24. (take_image satellite1 phenomenon10 instrument2 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 5 of 6
25. (turn_to satellite0 phenomenon11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 6
26. (take_image satellite0 phenomenon11 instrument0 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 6 of 6
